# Bonus Work for SQL-Challenge

In [1]:
# enable jupyter notebook to load from the .env file. I installed python-dotenv for this.
%load_ext dotenv
%dotenv

In [2]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

database_url = os.environ.get('DATABASE_URL')
    
from sqlalchemy import create_engine

engine = create_engine(database_url)

connection = engine.connect()

## Import tables from the Postgres employee database into Pandas.

In [3]:
# import employees table into a pandas df
employee_df = pd.read_sql_query('select * from employees',con=engine)

# import salaries table into a pandas df
salary_df = pd.read_sql_query('select * from salaries',con=engine)

# merge employee df and salary df
employee_final_df = pd.merge(employee_df, salary_df, on=['emp_no'])

In [4]:
employee_final_df

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,"$40,000.00"
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,"$53,422.00"
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,"$48,973.00"
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,"$40,000.00"
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,"$40,000.00"
...,...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28,"$69,696.00"
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26,"$75,355.00"
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24,"$61,886.00"
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08,"$62,772.00"
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23,"$41,708.00"